Autodesk.Revit.DB.IPDFParametersProvider.OnPageSize(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.BoundingBoxUV)
Receiving the PDF page size, in PDF user space coordinates, which is the same as the PDF media box size.
viewId:
The ElementId of the view to be exported.
mediaBox:
The PDF page size for the view to be exported, in PDF user space coordinates.
Since:
2021.1

Autodesk.Revit.DB.IPDFParametersProvider.ProvideParameters(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Provides parameters to be embedded into PDF for each Revit element.
aDoc:
The document which PDF exporter is exporting. And it should be the host document if there are links.
elemId:
The ElementId of the element which PDF exporter is processing. It might be the ElementId of the linked document.
linkInstanceId:
The ElementId of the link instance which the element belongs to, or invalidElementId when the element belongs to the host document.
viewId:
The view id which the element belongs to.
Returns:
The given element's external parameters.
Since:
2021.1

Autodesk.Revit.DB.IPDFParametersProvider.ProvideTag(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Provides tag to be embedded into PDF for each Revit element.
aDoc:
The document which PDF exporter is exporting. And it should be the host document if there are links.
elemId:
The ElementId of the element which PDF exporter is processing. It might be the ElementId of the linked document.
linkInstanceId:
The ElementId of the link instance which the element belongs to, or invalidElementId when the element belongs to the host document.
viewId:
The view id which the element belongs to.
Returns:
The given element's tag.
Since:
2021.1

Autodesk.Revit.DB.IPDFParametersProvider
Callback class providing parameters to be embedded into PDF for each Revit element.
Since:
2021.1